# 📚 Шаблон для практического задания
# Тема: Работа с базами данных в Python с использованием SQLite (DB API 2.0)
# Задание: Реализовать простую библиотечную систему

import sqlite3
from datetime import date

conn = sqlite3.connect('library.db')
cursor = conn.cursor()

# 📌 Функция создания таблиц
def create_tables():
    """
    Создай три таблицы: Books, Users, Borrowings.
    Используй CREATE TABLE IF NOT EXISTS и укажи типы данных.
    Не забудь задать первичные ключи и связи (FOREIGN KEY).
    """
    pass  # Напиши код создания таблиц здесь вместо pass

# 📌 Функция заполнения базы начальными данными
def seed_data():
    """
    Вставь в таблицы Books и Users несколько строк с начальными данными.
    Используй executemany() и параметризованные запросы (?).
    """
    pass  # Вставь книги и пользователей в таблицы здесь вместо pass

# 📌 Функция выдачи книги
def borrow_book(user_id, book_id):
    """
    Проверь, доступна ли книга.
    Если да — выдай её (обнови поле available в Books и создай запись в Borrowings).
    Обработай возможные ошибки (например, книга уже выдана).
    """
    pass  # Реализуй выдачу книги здесь вместо pass

# 📌 Функция возврата книги
def return_book(book_id):
    """
    Отметь книгу как доступную.
    Проверь, что она действительно была выдана.
    """
    pass  # Реализуй возврат книги здесь вместо pass

# 📌 Функция отображения всех книг
def show_books():
    """
    Выведи список всех книг с их статусом: 'Доступна' или 'Выдана'.
    """
    pass  # Реализуй вывод всех книг здесь вместо pass

# 📌 Функция показа книг, выданных конкретному пользователю
def show_user_books(user_id):
    """
    Выведи список книг, которые на руках у пользователя.
    Используй JOIN между Borrowings и Books.
    """
    pass  # Реализуй поиск книг пользователя здесь вместо pass

# 📌 Функция поиска книг по ключевому слову
def search_books(keyword):
    """
    Найди книги по названию или автору.
    Используй LIKE и подстановку (%ключевое_слово%).
    """
    pass  # Реализуй поиск книг здесь вместо pass

# 📌 Функция добавления нового пользователя
def add_user(name, email):
    """
    Вставь нового пользователя в таблицу Users.
    Обработай исключение, если email уже есть в базе.
    """
    pass  # Реализуй добавление пользователя здесь вместо pass

# 🧭 Главное меню приложения
def main_menu():
    """
    Обеспечивает взаимодействие с пользователем через консольное меню.
    """
    while True:
        print("\n📚 Главное меню:")
        print("1. Показать все книги")
        print("2. Выдать книгу")
        print("3. Вернуть книгу")
        print("4. Показать книги пользователя")
        print("5. Поиск книги")
        print("6. Добавить пользователя")
        print("7. Выход")

        choice = input("Выберите действие: ")

        if choice == '1':
            show_books()
        elif choice == '2':
            try:
                user_id = int(input("ID пользователя: "))
                book_id = int(input("ID книги: "))
                borrow_book(user_id, book_id)
            except ValueError:
                print("❌ Введите корректные числа.")
        elif choice == '3':
            try:
                book_id = int(input("ID книги для возврата: "))
                return_book(book_id)
            except ValueError:
                print("❌ Введите корректный ID.")
        elif choice == '4':
            try:
                user_id = int(input("ID пользователя: "))
                show_user_books(user_id)
            except ValueError:
                print("❌ Введите корректный ID.")
        elif choice == '5':
            keyword = input("Введите слово для поиска: ")
            search_books(keyword)
        elif choice == '6':
            name = input("Имя пользователя: ")
            email = input("Email пользователя: ")
            add_user(name, email)
        elif choice == '7':
            print("👋 До свидания!")
            break
        else:
            print("⚠️ Некорректный выбор. Попробуйте снова.")

# ▶️ Запуск приложения
if __name__ == '__main__':
    create_tables()
    # seed_data()  # Раскомментируй один раз для заполнения начальными данными
    main_menu()
    conn.close()